project/app/controllers/polls_controller.rb

	def create
		@poll = Poll.new(poll_params)
		if @poll.save
---
INSERT INTO "polls" ("topic", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic", "teste"], ["created_at", "2015-06-22 17:26:22.299797"], ["updated_at", "2015-06-22 17:26:22.299797"]]

	def edit
		@poll = Poll.find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@poll = Poll.find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		@poll = Poll.find_by_id(params[:id])
		if @poll.destroy
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]